# Считалочка
# Дано N человек, считалка из K слогов. Считалка начинает считать с первого человека.
# Когда считалка досчитывает до k-го слога, человек, на котором она остановилась, вылетает.
# Игра происходит до тех пор, пока не останется последний человек. Для данных N и К дать номер
# последнего оставшегося человека.

people = [...]  # N
syllables = [...]  # K

index = 0
while len(people) > 1:
    index = (index + len(syllables) - 1) % len(people)
    people.pop(index)

print(f"Последнего оставшийся человек: {people[0]}")